### 18- SQL Input, Output, and Connection

In [1]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine

In [2]:
temp_db = create_engine('sqlite:///:memory:')

In [3]:
#create a dataframe
df = pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4,4)),columns=['a', 'b', 'c', 'd'])

In [4]:
df

    a   b   c   d
0  11  60  92  94
1  25  21  36   2
2  85  58   7  13
3  47  41  82  59

In [5]:
#use sql
df.to_sql(name='new_table', con=temp_db)

4

In [6]:
new_df = pd.read_sql(sql='new_table', con=temp_db)

In [7]:
new_df

   index   a   b   c   d
0      0  11  60  92  94
1      1  25  21  36   2
2      2  85  58   7  13
3      3  47  41  82  59

In [11]:
#pass a SQL query into a dataframe
result = pd.read_sql_query(sql="SELECT a,d FROM new_table", con=temp_db)

In [12]:
result

    a   d
0  11  94
1  25   2
2  85  13
3  47  59